In [8]:
%%writefile sample.py 
no, score, name 
1, 1.11, one  
2, 2.22, two
3, 3.33, three

Writing sample.py

In [7]:
# 매직명령어, 셀 전체가 파일화 되기 때문에 주석을 달수 없다..
%%writefile sample.py #파일을 새로 만드는 명령
no, score, name # 열 제목
1, 1.11, one   # 행 내용
2, 2.22, two
3, 3.33, three

UsageError: Line magic function `%%writefile` not found.

## 데이터 입출력
- csv, excel, html, json, hdf5, sas, stats, sql ... 
- csv: 쉼표로 구분되어있는 텍스트파일로 가장 많이 이용됨.

### 데이터 입출력

In [1]:
import numpy as np
import pandas as pd

In [9]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 584C-163F

 C:\k_digital\Sourcce\Data Sicence with python 디렉터리

2022-10-26  오전 09:11    <DIR>          .
2022-10-26  오전 09:11    <DIR>          ..
2022-10-26  오전 09:01    <DIR>          .ipynb_checkpoints
2022-10-24  오전 11:59    <DIR>          __pycache__
2022-10-24  오후 09:34           147,405 1.Numpy_102422'.ipynb
2022-10-25  오후 02:12             6,113 2. 기술통계.ipynb
2022-10-25  오후 05:45            86,607 3.Pandas_102522'.ipynb
2022-10-26  오전 09:11             2,117 4. Pandas Data Analysis.ipynb
2022-10-24  오전 10:24               179 makeFunctions.py
2022-10-24  오후 12:18               152 my_array1.npy
2022-10-24  오후 12:22               554 my_array2.npz
2022-10-25  오후 12:04            10,256 Numpy복슴_102522'.ipynb
2022-10-26  오전 09:11                64 sample.py
               9개 파일             253,447 바이트
               4개 디렉터리  172,785,790,976 바이트 남음

In [11]:
# csv 파일 읽기
## header 열머리글(defalt = T, 없으면 None), sep 구분자(탭키인경우'\t')
pd.read_csv('sample.py')

   no   score   name
0   1    1.11   one
1   2    2.22     two
2   3    3.33   three

In [13]:
%%writefile sample1.csv 
1, 1.11, one  
2, 2.22, two
3, 3.33, three

Overwriting sample1.csv

In [16]:
pd.read_csv('sample1.csv', header = None)

   0     1       2
0  1  1.11   one
1  2  2.22     two
2  3  3.33   three

In [18]:
pd.read_csv('sample1.csv', names=['c1','c2','c3'])

   c1    c2      c3
0   1  1.11   one
1   2  2.22     two
2   3  3.33   three

In [20]:
# 첫번째열을 행머릿글(인덱스)로 설정하고 싶은경우
pd.read_csv('sample.py', index_col='no')

     score   name
no
1     1.11   one
2     2.22     two
3     3.33   three

In [21]:
%%writefile sample2.txt
c1      c2      c3      c4
0.179187 -1.538472 1.347553 1.43381
1.179187 -2.538472 2.347453 2.43681
2.179187 -3.538472 3.347353 3.45381
3.179187 -4.538472 3.217553 0.63381

Writing sample2.txt

In [22]:
# 구분자가 , 아닌 공백처리(길이가 정해져 있지 않은)인경우 판다스의 정규 표현식을 이용
## sep = '\s+'
pd.read_csv('sample2.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179187 -1.538472  1.347553  1.43381
1  1.179187 -2.538472  2.347453  2.43681
2  2.179187 -3.538472  3.347353  3.45381
3  3.179187 -4.538472  3.217553  0.63381

### 데이터 불러오기

In [23]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df = pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [26]:
# df내보내기
df.to_csv('sample3.csv', header = True)

In [27]:
# 불러오기
!type sample3.csv

,state,year,pop
0,Ohio,2000,1.5
1,Ohio,2001,1.7
2,Ohio,2002,3.6
3,Nevada,2001,2.4
4,Nevada,2002,2.9
5,Nevada,2003,3.2

In [28]:
%ls

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 584C-163F

 C:\k_digital\Sourcce\Data Sicence with python 디렉터리

2022-10-26  오전 09:27    <DIR>          .
2022-10-26  오전 09:27    <DIR>          ..
2022-10-26  오전 09:01    <DIR>          .ipynb_checkpoints
2022-10-24  오전 11:59    <DIR>          __pycache__
2022-10-24  오후 09:34           147,405 1.Numpy_102422'.ipynb
2022-10-25  오후 02:12             6,113 2. 기술통계.ipynb
2022-10-25  오후 05:45            86,607 3.Pandas_102522'.ipynb
2022-10-26  오전 09:27            17,674 4. Pandas Data Analysis.ipynb
2022-10-24  오전 10:24               179 makeFunctions.py
2022-10-24  오후 12:18               152 my_array1.npy
2022-10-24  오후 12:22               554 my_array2.npz
2022-10-25  오후 12:04            10,256 Numpy복슴_102522'.ipynb
2022-10-26  오전 09:26               125 sample.csv3
2022-10-26  오전 09:11                64 sample.py
2022-10-26  오전 09:15                46 sample1.csv
2022-10-26  오전 09:22               176 sample2.txt
2022-10-26  오전 09:27               125 sample3.csv
              13개 파일             269,476 바이트
               4개 디렉터리  172,793,597,952 바이트 남음

## 데이터프레임 고급 인덱싱
- 명확하지 않은 값으로 불러오긴 힘들어서 만들어진, 행을 불러올때(열은 컬럼값부르면 됨)
- loc: 라벨값을 기준으로 인덱싱할 때 사용 
 - df.loc[행 인덱스 값] or df.loc[행 인덱싱값, 열 인덱싱값] => 라벨링된 걸 불러오는거
- iloc: 정수 기반의 인덱싱

### loc와 iloc

In [29]:
df = pd.DataFrame(np.arange(10, 22).reshape(3,4),
                 index = ['a','b','c'],
                 columns = ['one','two','three','four'])
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   18   19     20    21

In [30]:
# 인덱싱값 하나만 받아오는 경우, series로 값이 출력
df.loc['b']

one      14
two      15
three    16
four     17
Name: b, dtype: int32

In [32]:
# : 연산자와 함께 사용하면 loc안붙여도 무방
print(df.loc['b':'c']) # 라벨값은 문자까지 다 불러온다. (정수 인덱스는 마지막값 -1)
print(df['b':'c'])

   one  two  three  four
b   14   15     16    17
c   18   19     20    21
   one  two  three  four
b   14   15     16    17
c   18   19     20    21

In [33]:
# 출력 값이 list이고 싶으면 [[]]
df.loc[['b','c']]

   one  two  three  four
b   14   15     16    17
c   18   19     20    21

In [34]:
# 리스트 안에 콜론은 불가.
df[['b':'c']]

SyntaxError: invalid syntax (Temp/ipykernel_3136/2234262677.py, line 1)

In [35]:
# col값 불러오고 싶을때
df['one']

a    10
b    14
c    18
Name: one, dtype: int32

In [36]:
# 다이렉트로 불러올 수 도 있음 (col값은)
df.one

a    10
b    14
c    18
Name: one, dtype: int32

In [37]:
# 논리 연산자는 불린값으로
df.one > 15

a    False
b    False
c     True
Name: one, dtype: bool

In [40]:
df[df.one > 15]

   one  two  three  four
c   18   19     20    21

In [42]:
df.loc[df.one > 15]

   one  two  three  four
c   18   19     20    21

In [43]:
# 이걸 함수로 작업하고 싶을 때
def select_row(df):
    return df.one > 15

In [44]:
select_row(df)

a    False
b    False
c     True
Name: one, dtype: bool

In [45]:
df[select_row(df)]

   one  two  three  four
c   18   19     20    21

### loc로 정수 인덱스 불러오기

In [47]:
df2 = pd.DataFrame(np.arange(10,26).reshape(4,4),
                  columns=list('ABCD'))
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [48]:
# 숫자 인덱스를 라벨 취급할 수 있다.
df2.loc[1:2] 
## 주의! iloc와 달리 라벨취급 하기 때문에 마지막 값까지 모두 출력된다.

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

### 인덱싱 값을 이용하여 행과 열 모두 추출하는 경우
- df.loc[rowindex, colindex]

In [51]:
# df2의 값 10을 가져오고 싶다.
df2.loc[0,'A']

10

In [52]:
df # 라벨링 헷갈리지 마라고

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   18   19     20    21

In [53]:
# 값 15 불러오기
df.loc['b','two']

15

In [54]:
# 슬라이싱
df.loc['b':, 'one']

b    14
c    18
Name: one, dtype: int32

In [55]:
df.loc['a',:]

one      10
two      11
three    12
four     13
Name: a, dtype: int32

In [56]:
df.loc[['a','b'],['two','four']]

   two  four
a   11    13
b   15    17

In [57]:
# 조건 담기[행조건; 샘플, 추출]
df.loc[df.one>10,['three','four']]

   three  four
b     16    17
c     20    21

### iloc 인덱싱

In [58]:
# df의 값 11
df.iloc[0,1]

11

In [61]:
df.iloc[:2,2]  # 숫자 인덱스이니 마지막값 -1 만큼 출력됨.

a    12
b    16
Name: three, dtype: int32

In [62]:
df.iloc[0, -2:] # 끝에서 2번째

three    12
four     13
Name: a, dtype: int32

In [67]:
df.iloc[2:3,1:3]

   two  three
c   19     20

In [68]:
df.iloc[-1,1:3]

two      19
three    20
Name: c, dtype: int32

In [70]:
# 마지막 줄에 2씩 곱한 값
df.iloc[-1] = df.iloc[-1] * 2
df

   one  two  three  four
a   10   11     12    13
b   14   15     16    17
c   72   76     80    84

### 연습

In [87]:
# 모든행과 열에 라벨을 가지고 있는 5행 5열 이상의 크기를 가진 데이터프레임을 생성하시오.
s = pd.DataFrame(np.arange(1,31).reshape(5,6),
                index = list('GHJKL'),
                columns = list('ABCDEF'))
s
## DF만들때 함수를 이용하니깐 당연 소괄호인데 []에 너무 집착해서 ㅜㅜ

    A   B   C   D   E   F
G   1   2   3   4   5   6
H   7   8   9  10  11  12
J  13  14  15  16  17  18
K  19  20  21  22  23  24
L  25  26  27  28  29  30

In [89]:
# 10가지 이상의 방법으로 특정 행또는 행과 열 추출
## 1
s.loc['G']

A    1
B    2
C    3
D    4
E    5
F    6
Name: G, dtype: int32

In [91]:
## 2
s.iloc[1:3]

    A   B   C   D   E   F
H   7   8   9  10  11  12
J  13  14  15  16  17  18

In [92]:
## 3
s.A

G     1
H     7
J    13
K    19
L    25
Name: A, dtype: int32

In [122]:
## 4
s.loc['G','C']

3

In [97]:
## 5
s[2:4]

    A   B   C   D   E   F
J  13  14  15  16  17  18
K  19  20  21  22  23  24

In [100]:
## 6
s[['E']]

    E
G   5
H  11
J  17
K  23
L  29

In [101]:
## 7 
s['E']

G     5
H    11
J    17
K    23
L    29
Name: E, dtype: int32

In [110]:
## 8
s[s.D>10]

    A   B   C   D   E   F
J  13  14  15  16  17  18
K  19  20  21  22  23  24
L  25  26  27  28  29  30

In [113]:
## 9
s.iloc[-3:,3]

J    16
K    22
L    28
Name: D, dtype: int32

In [116]:
## 10
s.loc[s.E>20, ['E']]

    E
K  23
L  29

In [119]:
s.loc[s.E > 25]

    A   B   C   D   E   F
L  25  26  27  28  29  30

## 데이터 조작

### 데이터 개수 세기: count (NaN값은 제외됨)

In [123]:
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [124]:
s.count() # 결측값 제외하여 카운트

9

In [128]:
np.random.seed(2) # seed 안에는 0보다 큰 정수만 들어가면 됨.
df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)
df.iloc[2,3]= np.nan  # 2행 3열에 결측값 담기
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [129]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      float64
 1   1       4 non-null      float64
 2   2       4 non-null      float64
 3   3       3 non-null      float64
dtypes: float64(4)
memory usage: 256.0 bytes

In [130]:
df.count()

0    4
1    4
2    4
3    3
dtype: int64

### 외부 데이터로 연습

In [131]:
# 외부 데이터로 연습하기
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [132]:
# 데이터 구조 보기 : info()
## 카테고리는 R의 factor와 동일,
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [133]:
titanic.shape

(891, 15)

In [134]:
# 데이터 내용 미리보기: head(), tail()
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [135]:
titanic.count() # 결측값 확인이 가능하다.

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [136]:
# 도수분포 value_counts // R의 table()와 유사
## Series타입의 건수만 계산이 가능하다.
titanic['embarked'].value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [138]:
# Q. 객실 등급별 승객수를 추출하시오.
## 내림차순으로 정렬되서 출력
titanic['pclass'].value_counts()

3    491
1    216
2    184
Name: pclass, dtype: int64

### 정렬
- sort_index(), 인덱스 기준으로
- sort_values(), 값을 기준으로
- 기본적으로 오름차순 됨
- 내림차순으로 하고 싶으면, ascending = False

In [139]:
titanic['pclass'].value_counts().sort_index()

1    216
2    184
3    491
Name: pclass, dtype: int64

In [140]:
# 결측 값은 맨 마지막에 출력
titanic['age'].sort_values()

803    0.42
755    0.67
644    0.75
469    0.75
78     0.83
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: age, Length: 891, dtype: float64

In [141]:
titanic['age'].sort_values(ascending = False) # 내림차순으로 해도 na는 마지막에

630    80.0
851    74.0
493    71.0
96     71.0
116    70.5
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: age, Length: 891, dtype: float64

In [142]:
# key값이 없는경우, by옵션을 이용하여 기준값을 설정해야한다.
titanic.sort_values(by='age')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
78,1,2,male,0.83,0,2,29.0000,S,Second,child,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [143]:
## 정렬 키값이 두개인경우
titanic.sort_values(by = ['age','pclass']) # list로 묶어서

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
644,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False
78,1,2,male,0.83,0,2,29.0000,S,Second,child,False,NaN,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
859,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
863,0,3,female,NaN,8,2,69.5500,S,Third,woman,False,NaN,Southampton,no,False
868,0,3,male,NaN,0,0,9.5000,S,Third,man,True,NaN,Southampton,no,True
878,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

#### 다른 예시

In [144]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100)) # 0~5까지 100개를 만들라
s2.tail()

95    4
96    5
97    2
98    4
99    3
dtype: int32

In [145]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [146]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [147]:
# col 0의 건수 카운트
df[0].value_counts()

3.0    2
0.0    1
4.0    1
Name: 0, dtype: int64

In [148]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [150]:
s.sort_values(ascending = False)

9    9.0
8    8.0
7    7.0
6    6.0
5    5.0
4    4.0
2    2.0
1    1.0
0    0.0
3    NaN
dtype: float64

In [151]:
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [152]:
df[2].sort_values()

1    2.0
0    3.0
2    4.0
3    4.0
Name: 2, dtype: float64

In [153]:
df.sort_values(by = 2)

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [154]:
df.sort_values(by = [1, 2],ascending = False) # 1을 기준으로 하고 겹칠 때는 2를 기준으로

     0    1    2    3
3  4.0  3.0  4.0  2.0
2  3.0  2.0  4.0  NaN
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0

#### titanic 데이터 셋을 이용
- 승객의 성별인원수, 나이별 인원수, 객실별인원수, 사망/생존 인원수 추출
- sort_values를 이용하여서 나타낼것

In [155]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [156]:
# 성별인원수
titanic['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

In [157]:
# 성별인원수
titanic.sort_values(by='sex')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
383,1,1,female,35.0,1,0,52.0000,S,First,woman,False,NaN,Southampton,yes,False
218,1,1,female,32.0,0,0,76.2917,C,First,woman,False,D,Cherbourg,yes,True
609,1,1,female,40.0,0,0,153.4625,S,First,woman,False,C,Southampton,yes,True
216,1,3,female,27.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
215,1,1,female,31.0,1,0,113.2750,C,First,woman,False,D,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
371,0,3,male,18.0,1,0,6.4958,S,Third,man,True,NaN,Southampton,no,False
372,0,3,male,19.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
373,0,1,male,22.0,0,0,135.6333,C,First,man,True,NaN,Cherbourg,no,True
360,0,3,male,40.0,1,4,27.9000,S,Third,man,True,NaN,Southampton,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [161]:
titanic.value_counts('age').sort_index()

age
0.42     1
0.67     1
0.75     2
0.83     2
0.92     1
        ..
70.00    2
70.50    1
71.00    2
74.00    1
80.00    1
Length: 88, dtype: int64

In [159]:
titanic['age'].sort_values()

803    0.42
755    0.67
644    0.75
469    0.75
78     0.83
       ...
859     NaN
863     NaN
868     NaN
878     NaN
888     NaN
Name: age, Length: 891, dtype: float64

In [160]:
titanic['pclass'].sort_values()

445    1
310    1
309    1
307    1
306    1
      ..
379    3
381    3
382    3
371    3
890    3
Name: pclass, Length: 891, dtype: int64

In [158]:
titanic.sort_values(by='alive')

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
519,0,3,male,32.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
521,0,3,male,22.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
522,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
524,0,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
546,1,2,female,19.0,1,0,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
215,1,1,female,31.0,1,0,113.2750,C,First,woman,False,D,Cherbourg,yes,False
216,1,3,female,27.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
218,1,1,female,32.0,0,0,76.2917,C,First,woman,False,D,Cherbourg,yes,True
445,1,1,male,4.0,0,2,81.8583,S,First,child,False,A,Southampton,yes,False

#### 행/열 합계
- sum(axis), axis = 0 행, axis = 1 열

In [166]:
df2 = pd.DataFrame(np.random.randint(10,size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  6  6  2  7  7  0  6  5
1  1  4  6  0  6  5  1  2
2  1  5  4  0  7  8  9  5
3  7  0  9  3  9  1  4  4

In [167]:
# 행방향의 합계(열기준) 
df2.sum(axis = 1)

0    39
1    25
2    39
3    37
dtype: int64

In [168]:
df2['rowSum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  rowSum
0  6  6  2  7  7  0  6  5      39
1  1  4  6  0  6  5  1  2      25
2  1  5  4  0  7  8  9  5      39
3  7  0  9  3  9  1  4  4      37

In [169]:
df2.sum() # axis = 0(defalut)

0          15
1          15
2          21
3          10
4          29
5          14
6          20
7          16
rowSum    140
dtype: int64

In [171]:
df2.loc['Total', :] = df2.sum()
df2

          0     1     2     3     4     5     6     7  rowSum
0       6.0   6.0   2.0   7.0   7.0   0.0   6.0   5.0    39.0
1       1.0   4.0   6.0   0.0   6.0   5.0   1.0   2.0    25.0
2       1.0   5.0   4.0   0.0   7.0   8.0   9.0   5.0    39.0
3       7.0   0.0   9.0   3.0   9.0   1.0   4.0   4.0    37.0
Total  15.0  15.0  21.0  10.0  29.0  14.0  20.0  16.0   140.0

#### 연습문제
1. 타이타닉호의 승객 평균나이는?
2. 타이타닉호의 승객중 여성의 평균나이는 
3. 타이타닉호 승객중 1등실에 탑승한 여성의 평균나이는?

In [175]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [177]:
# 평균나이
titanic['age'].mean()

29.69911764705882

In [181]:
# 여성승객의 평균나이t
titanic.loc[titanic.sex == 'female', 'age'].mean()

27.915708812260537

In [182]:
# 1등급 클래스의 여성 평균나이.
titanic.loc[(titanic.pclass == 1) & (titanic.sex == 'female'),'age'].mean()

34.61176470588235

## apply 함수
- 행이나 열에 반복적으로 처리하는 함수를 적용하는 함수
- 람다(lambda) 함수: 익명의 함수
 - 형식: lambda 입력값(매개변수) : 출력값(표현식) , axis
 - 오토캐드, 인공지능언어중 리스투 등에서 사용하던거를 가져와서 쓰는거
 
 ### 기본 개념

In [183]:
# 두 수를 입력받아 합을 계산하는 함수
def hap(x, y):
    return x + y

In [184]:
hap(10, 20)
## 이렇게 만들던걸 이름이 없는 람다함수를 만들고 싶음..

30

In [187]:
# 람다 형식으로 표현
## () 바로 출력해라는 말도 되고, 우선순위 부여
(lambda x,y : x + y)(10, 20)

30

### map(함수, 리스트)

In [188]:
# 함수식을 리스트만큼 반복하여 리스트에 담겠다라는 말
list(map((lambda x : x ** 2), range(5)))

[0, 1, 4, 9, 16]

In [189]:
df3 = pd.DataFrame({
    'A':[1,3,4,3,4],
    'B':[2,3,1,2,3],
    'C':[1,5,2,4,4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [190]:
# 각 열에 최대값과 최소값의 차이를 구하는 작업
## 입력값을 열로 받을겨
df3.apply(lambda x : x.max() - x.min()) # axis = 0(defalt)

A    3
B    2
C    4
dtype: int64

In [191]:
# 행단위로 하고 싶다면,
df3.apply(lambda x : x.max() - x.min(), axis =1)

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [194]:
# 각 열의 값들의 건수를 구하시오.
df3.apply(lambda x : pd.value_counts(x))

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [193]:
df3.apply(pd.value_counts) # 열 자체가 series여서

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [195]:
# Q. 타이타닉 호의 승객중 나이가 20살을 기준으로 성인(Adult)과 미성년자(Child)를 구별하여 파생변수
# adult/child에 담는 작업을 수행하시오.
titanic['adult/child'] = titanic.apply(if titanic.age >= 20:
                                       return titanic['adult/child'] = 'Adult'
                                      else:
                                      titanic['adult/child'] = 'Child', axis = 1)
# 내가 시도. 함수 정의 없이 바로 시작할 수 있는게 람다함수 밖에 없어서

SyntaxError: invalid syntax (Temp/ipykernel_3136/2494955424.py, line 3)

In [198]:
titanic['adult/child'] = titanic.apply(lambda df : 'adult' if df.age >= 20 else 'child', axis = 1)

In [201]:
titanic.head()
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [200]:
# 위와 같은 작업을 하는 함수.
def adult_chile(df):
    if df.age >= 20:
        'adult'
    else:
        'child'

In [253]:
# apply로 따지면 저런 의미다..
titanic.apply(adult_chile(titanic), axis=1)
## 이거 실행시키고 싶으면 ()를 뺴줘야함.
## apply는 안에 함수를 쓰지만()는 없애야함(즉 함수를 변수처럼 불러야해)

0      None
1      None
2      None
3      None
4      None
       ...
886    None
887    None
888    None
889    None
890    None
Length: 891, dtype: object

### fillna()
- NaN 값을 원하는 값으로 대체하는 함수

In [203]:
df3.apply(pd.value_counts)

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [204]:
# 위 값중 결측값을 0.0으로 채우겠다.
df3.apply(pd.value_counts).fillna(0.0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [218]:
# Q. 타이타닉호의 age결측값을 age평균값으로 채우면?
## 평균값
titanic['age'].mean()
titanic['age'].fillna(29)

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    29.0
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

### astype()
- 자료형을 바꾸는 함수

In [221]:
# 실수 자료형을 정수형으로 바꾸기
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

### 데이터프레임의 인덱스 설정 및 제거
- set_index: 기존의 행 인덱스를 제거하고 데이터 열 중 하나를 인덱스로 설정
- reset_index: 기존의 행 인덱스를 제거하고 인덱스를 데이터 열로 변경

In [222]:
# 첫번째 열은 ABCDE로 컬럼하나를 채우고, (3,5)짜리 랜덤을 전치 시켜서
# vstack(열과 열을 합친거)이 뒤에것을 합쳐서 리스트로 만든거(ab..랑 3,5짜리) / h는 행과행
df1 = pd.DataFrame(np.vstack([list('ABCDE'), np.round(np.random.rand(3,5),2)]).T,
                  columns = ['C1','C2','C3','C4'])
df1

  C1    C2    C3    C4
0  A  0.07  0.12  0.86
1  B  0.76  0.02  0.54
2  C  0.75  0.03  0.55
3  D  0.92  0.03  0.84
4  E  0.71  0.25  0.12

In [224]:
# 기존 자동 설정된 인덱스를 없애고 c1의 값을 index로 설정
df2 = df1.set_index('C1')
df2

      C2    C3    C4
C1
A   0.07  0.12  0.86
B   0.76  0.02  0.54
C   0.75  0.03  0.55
D   0.92  0.03  0.84
E   0.71  0.25  0.12

In [225]:
df2.set_index('C2') # 기존 열 삭제후 지정

        C3    C4
C2
0.07  0.12  0.86
0.76  0.02  0.54
0.75  0.03  0.55
0.92  0.03  0.84
0.71  0.25  0.12

In [227]:
# index가 되었던 C1을 다시 열로 변경시키는 것
df2.reset_index()

  C1    C2    C3    C4
0  A  0.07  0.12  0.86
1  B  0.76  0.02  0.54
2  C  0.75  0.03  0.55
3  D  0.92  0.03  0.84
4  E  0.71  0.25  0.12

In [228]:
# 인덱스를 컬럼으로 바꾸지 않고 지우겠다면, drop = True
df2.reset_index(drop=True)
## C1이 삭제되고 자동 인덱스가 생성된다.

     C2    C3    C4
0  0.07  0.12  0.86
1  0.76  0.02  0.54
2  0.75  0.03  0.55
3  0.92  0.03  0.84
4  0.71  0.25  0.12

### 다중 인덱스
- 행이나 열에 인덱스를 둘 때 여러개를 두는 것.

In [230]:
df3 = pd.DataFrame(np.round(np.random.randn(5,4),2),
                  columns = [['A','A','B','B'],
                             ['C1','C2','C1','C2']]) # 다중 인덱스
df3

      A           B
     C1    C2    C1    C2
0  0.63 -1.61  0.06  0.46
1  0.68 -0.60  1.00 -0.31
2  0.37  1.61 -0.24 -0.34
3  0.49  1.74  0.07  0.47
4 -0.65 -0.78 -0.78  0.62

#### 열에 인덱스(다중)를 추가하는 경우

In [234]:
df3.columns # 다중 인덱스
# 이름 붙일 떄
df3.columns.names = ['Cidx1','Cidx2']
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      0.63 -1.61  0.06  0.46
1      0.68 -0.60  1.00 -0.31
2      0.37  1.61 -0.24 -0.34
3      0.49  1.74  0.07  0.47
4     -0.65 -0.78 -0.78  0.62

#### 행에 인덱스(다중)를 추가하는 경우

In [235]:
df3.index

RangeIndex(start=0, stop=5, step=1)

In [239]:
df4 = pd.DataFrame(np.round(np.random.randn(6,4),2),
                  columns=[['A','A','B','B'],['C','D','C','D']],
                  index= [['M','M','M','F','F','F'],
                          ['id_' + str(i+1) for i in range(3)]*2])
df4

           A           B
           C     D     C     D
M id_1  0.43  0.07 -0.45  0.60
  id_2  2.39 -0.12 -0.32  0.31
  id_3  2.46 -0.32 -1.82  0.68
F id_1  0.03  0.20  0.91 -2.13
  id_2  0.82  1.18 -0.20 -0.11
  id_3  1.41 -1.42  0.67 -0.77

In [236]:
# 리스트 내포
['id_' + str(i+1) for i in range(3)] * 2

['id_1', 'id_2', 'id_3', 'id_1', 'id_2', 'id_3']

In [240]:
df4.columns.names = ['Cidx1','Cidx2']
df4.index.names = ['Ridx1','Ridx2']
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   0.43  0.07 -0.45  0.60
      id_2   2.39 -0.12 -0.32  0.31
      id_3   2.46 -0.32 -1.82  0.68
F     id_1   0.03  0.20  0.91 -2.13
      id_2   0.82  1.18 -0.20 -0.11
      id_3   1.41 -1.42  0.67 -0.77

#### 행 인덱스와 열인덱스 교환
- stack(): 열인덱스 -> 행인덱스(반시계)
- unstack(): 행인덱스 -> 열인덱스(시계)
- 특정 인덱스 지정시 그것을 기준으로 교환됨.

In [241]:
# colindex가 다중이니깐 지정을 해주면 그것을 기준으로 교환
df4.stack('Cidx1')

Cidx2                 C     D
Ridx1 Ridx2 Cidx1
M     id_1  A      0.43  0.07
            B     -0.45  0.60
      id_2  A      2.39 -0.12
            B     -0.32  0.31
      id_3  A      2.46 -0.32
            B     -1.82  0.68
F     id_1  A      0.03  0.20
            B      0.91 -2.13
      id_2  A      0.82  1.18
            B     -0.20 -0.11
      id_3  A      1.41 -1.42
            B      0.67 -0.77

In [242]:
# 인덱스 값으로도 지정이 가능함.
df4.stack(1) # 'Cidx2'가 1의 위치니깐

Cidx1                 A     B
Ridx1 Ridx2 Cidx2
M     id_1  C      0.43 -0.45
            D      0.07  0.60
      id_2  C      2.39 -0.32
            D     -0.12  0.31
      id_3  C      2.46 -1.82
            D     -0.32  0.68
F     id_1  C      0.03  0.91
            D      0.20 -2.13
      id_2  C      0.82 -0.20
            D      1.18 -0.11
      id_3  C      1.41  0.67
            D     -1.42 -0.77

In [243]:
df3

Cidx1     A           B
Cidx2    C1    C2    C1    C2
0      0.63 -1.61  0.06  0.46
1      0.68 -0.60  1.00 -0.31
2      0.37  1.61 -0.24 -0.34
3      0.49  1.74  0.07  0.47
4     -0.65 -0.78 -0.78  0.62

In [255]:
# 다중 인덱스를 가지고 있는 경우 인덱스 값이 하나의 라벨이나 숫자가 아니라 튜플로 입력해야한다.
df3[('B','C1')]

0    0.06
1    1.00
2   -0.24
3    0.07
4   -0.78
Name: (B, C1), dtype: float64

In [258]:
# 행 인덱스도 함께 부르려면
df3.loc[0,('B','C1')] = 100
df3

Cidx1     A             B
Cidx2    C1    C2      C1    C2
0      0.63 -1.61  100.00  0.46
1      0.68 -0.60    1.00 -0.31
2      0.37  1.61   -0.24 -0.34
3      0.49  1.74    0.07  0.47
4     -0.65 -0.78   -0.78  0.62

In [259]:
# iloc의 인덱스는 튜플형태의 다중인덱스를 사용할 수 없다.(그래서 위치인덱스로)
df3.iloc[0,2]

100.0

In [260]:
# 상위 인덱스만 부르면, 하위 인덱스 값만 불러옴
df3['A']

Cidx2    C1    C2
0      0.63 -1.61
1      0.68 -0.60
2      0.37  1.61
3      0.49  1.74
4     -0.65 -0.78

In [261]:
df4

Cidx1           A           B
Cidx2           C     D     C     D
Ridx1 Ridx2
M     id_1   0.43  0.07 -0.45  0.60
      id_2   2.39 -0.12 -0.32  0.31
      id_3   2.46 -0.32 -1.82  0.68
F     id_1   0.03  0.20  0.91 -2.13
      id_2   0.82  1.18 -0.20 -0.11
      id_3   1.41 -1.42  0.67 -0.77

In [262]:
df4.loc[('M','id_1'),('A','C')]

0.43

## 데이터프레임 합성
- merge, concetenate

### merge

In [274]:
# 딕셔너리의 키가 컬럼명이 됨
df1 = pd.DataFrame({
    'userNo':[1001,1002,1003,1003,1005,1006,1007],
    'userName':['고둘리','도우너','그또치','고길동','고희동','마이콜','고영희']},
columns = ['userNo','userName'])
df1

   userNo userName
0    1001      고둘리
1    1002      도우너
2    1003      그또치
3    1003      고길동
4    1005      고희동
5    1006      마이콜
6    1007      고영희

In [275]:
df2 = pd.DataFrame({
    'userNo':[1001,1001,1005,1006,1007,1001],
    'price':[10000,20000,15000,5000,100000,30000]},
columns = ['userNo','price'])
df2

   userNo   price
0    1001   10000
1    1001   20000
2    1005   15000
3    1006    5000
4    1007  100000
5    1001   30000

In [265]:
# merge(합치려는 df1,2) // sql문의 inner join방식
## 공통된 값이 없으면 안나옴(제외되어 출력)
pd.merge(df1,df2)

   userNo userName   price
0    1001      고둘리   10000
1    1001      고둘리   20000
2    1001      고둘리   30000
3    1005      고희동   15000
4    1006      마이콜    5000
5    1007      고영희  100000

In [266]:
# outerjoin, how = 'outer', left,right..
# 이때 빈값은 NaN
pd.merge(df1,df2, how = 'outer')

   userNo userName     price
0    1001      고둘리   10000.0
1    1001      고둘리   20000.0
2    1001      고둘리   30000.0
3    1002      도우너       NaN
4    1003      그또치       NaN
5    1003      고길동       NaN
6    1005      고희동   15000.0
7    1006      마이콜    5000.0
8    1007      고영희  100000.0

In [267]:
# left join , 아우터랑 차이가 뭐지??
pd.merge(df1,df2, how = 'left')

   userNo userName     price
0    1001      고둘리   10000.0
1    1001      고둘리   20000.0
2    1001      고둘리   30000.0
3    1002      도우너       NaN
4    1003      그또치       NaN
5    1003      고길동       NaN
6    1005      고희동   15000.0
7    1006      마이콜    5000.0
8    1007      고영희  100000.0

In [268]:
# right join
pd.merge(df1,df2, how = 'right')

   userNo userName   price
0    1001      고둘리   10000
1    1001      고둘리   20000
2    1005      고희동   15000
3    1006      마이콜    5000
4    1007      고영희  100000
5    1001      고둘리   30000

### join()
- 행인덱스를 기준으로 결합을한다.
 - 그렇기에 매개가 되는 것을 인덱스로 설정을 해줘야함
 - df명.set_index('열이름', inplace=True)

In [279]:
# join메서드: 행 인덱스를 기준으로 결합한다.
df1.set_index('userNo', inplace=True) # inplace는 설정값을 바로 적용시켜주는 옵션

In [280]:
df2.set_index('userNo', inplace=True)

In [281]:
# 인덱스 설정 후 조인함수
df1.join(df2, how='outer')

       userName     price
userNo
1001        고둘리   10000.0
1001        고둘리   20000.0
1001        고둘리   30000.0
1002        도우너       NaN
1003        그또치       NaN
1003        고길동       NaN
1005        고희동   15000.0
1006        마이콜    5000.0
1007        고영희  100000.0

### concat함수
- 기준열을 사용하지 않고 단순히 데이터를 연결하는 방식
- 인덱스가 중복될 수 있다.
 - 그래서 중복되는 것을 재설정 해줄 필요가 있다.

In [282]:
s1 = pd.Series([0,1],index = ['A','B'])
s2 = pd.Series([2,3,4], index = ['A','B','C'])
s1, s2

(A    0
 B    1
 dtype: int64,
 A    2
 B    3
 C    4
 dtype: int64)

In [283]:
# 단순 연결
pd.concat([s1,s2])  # axis = 1 엎에 생성
## 인덱스가 중복도더라도 밑에 생성

A    0
B    1
A    2
B    3
C    4
dtype: int64

In [284]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2),
                  index = list('abc'),
                  columns = ['data1','data2'])
df1

   data1  data2
a      0      1
b      2      3
c      4      5

In [286]:
df2 = pd.DataFrame(5+np.arange(4).reshape(2,2),
                  index = list('ac'),
                  columns = ['data3','dat4'])
df2

   data3  dat4
a      5     6
c      7     8

In [287]:
# concat 적용
## 단순히 합치는 거라 중복 인덱스가 있을수도 있고 없는 값엔 자동을 NaN값이 출력
pd.concat([df1,df2], axis = 1)

   data1  data2  data3  dat4
a      0      1    5.0   6.0
b      2      3    NaN   NaN
c      4      5    7.0   8.0

## 그룹바이

In [289]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
colums = ['도시','연도','인구','지역']
df1 = pd.DataFrame(data, columns=colums)

df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

### pivot()
- 첫번쨰 파라미터: 행인덱스로 사용할 열이름
- 두번째 파라미터: 열인덱스로 사용할 열이름
- 세번째 파라미터: 데이터로 사용할 열이름

In [290]:
# 조회하고자하는 걸 빠르게 보기 위한 피벗테이블
df1.pivot('도시','연도','인구')

연도       2005       2010       2015
도시
부산  3512547.0  3393191.0  3448737.0
서울  9762546.0  9631482.0  9904312.0
인천        NaN   263203.0  2890451.0

### 그룹 분석
- 원하는 내용을 빠르게 분석하기 위한 것
- groupby()
 - 그룹바이와 자주 사용하는 내장하수
 - size, count: 그룹데이터 개수
 - mean, median, min, max
 - sum, prod(곱), std, var, quantile
 - 그룹 연산
  - first, last
  - agg, aggreate: 그룹을 설정한 후 여러가지의 함수를 한번에 처리하고 싶을 때 사용
  - describe //R의 summary와 유사
  - apply
  - transform

In [291]:
df2 = pd.DataFrame({
    'key1':list('AABBA'),
    'key2':['one','two','one','two','one'],
    'data1':[1,2,3,4,5],
    'data2':[10,20,30,40,50]
})
df2

  key1 key2  data1  data2
0    A  one      1     10
1    A  two      2     20
2    B  one      3     30
3    B  two      4     40
4    A  one      5     50

In [293]:
# 그룹 설정
groups = df2.groupby(df2.key1)
groups.groups # 주소만 출력되기때문에 속성 groups로 내용을 보는거.
## 결과 값을 보면 그룹화한 것에 인덱스가 지정되어 있는걸 확인할 수 있다.

{'A': [0, 1, 4], 'B': [2, 3]}

In [294]:
# A그룹과 B그룹 데이터들의 합계
groups.sum()

      data1  data2
key1
A         8     80
B         7     70

In [297]:
# 위 과정을 한 번에,  data1의 값만
df2.data1 # 추출할 값
df2.data1.groupby(df2.key1).sum()  # 추출할 값에서 그룹으로 묶어서 합을 구할 것이다.

key1
A    8
B    7
Name: data1, dtype: int64

In [298]:
# A,B데이터를 볼건데(그룹지을건데)그 중 데이터 1의 합계
df2.groupby(df2.key1)['data1'].sum()

key1
A    8
B    7
Name: data1, dtype: int64

In [300]:
df2.groupby(df2.key1).sum()['data1']

key1
A    8
B    7
Name: data1, dtype: int64

In [303]:
df2.data1 # 연산의 대상
df2.data1.groupby([df2.key1,df2.key2]).sum()  # 그룹화지어서 어떤 연산을 수행하는 지

key1  key2
A     one     6
      two     2
B     one     3
      two     4
Name: data1, dtype: int64